In [26]:
import pandas as pd
from sklearn import tree
from sklearn.model_selection import train_test_split
from sklearn import tree

In [27]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [38]:
inputs = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked','Survived'], axis='columns')
target = df.Survived
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [39]:
from sklearn.preprocessing import LabelEncoder
numsex = LabelEncoder()

In [40]:
inputs['SexUpdate'] = numsex.fit_transform(inputs['Sex'])

In [41]:
inputs.head()

   Pclass     Sex   Age     Fare  SexUpdate
0       3    male  22.0   7.2500          1
1       1  female  38.0  71.2833          0
2       3  female  26.0   7.9250          0
3       1  female  35.0  53.1000          0
4       3    male  35.0   8.0500          1

In [42]:
inputnew = inputs.drop('Sex',axis='columns')
inputnew.head()

   Pclass   Age     Fare  SexUpdate
0       3  22.0   7.2500          1
1       1  38.0  71.2833          0
2       3  26.0   7.9250          0
3       1  35.0  53.1000          0
4       3  35.0   8.0500          1

In [46]:
x_train,x_test,y_train,y_test = train_test_split(inputnew,target,train_size=0.8)

In [47]:
model = tree.DecisionTreeClassifier

In [49]:
x_test

     Pclass   Age     Fare  SexUpdate
404       3  20.0   8.6625          0
876       3  20.0   9.8458          1
255       3  29.0  15.2458          0
761       3  41.0   7.1250          1
89        3  24.0   8.0500          1
..      ...   ...      ...        ...
279       3  35.0  20.2500          0
554       3  22.0   7.7750          0
72        2  21.0  73.5000          1
785       3  25.0   7.2500          1
33        2  66.0  10.5000          1

[179 rows x 4 columns]

In [50]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [ ]:
model.fit(x_train,y_train)